app/views/home/_featured_videos.html.haml

SELECT "thumbnails".* FROM "thumbnails" WHERE "thumbnails"."video_id" = 133 LIMIT 1
---
			%div.thumbnail-wrapper
				=link_to (image_tag vid.thumbnails.first.url, :class => "thumbnails" ,:alt => "#{vid.category.title.to_s}_#{vid.title.to_s}"), video_path(vid.id)