app/views/home/_recent_videos.html.haml

-@latest_videos.each do |vid|
	-unless vid.thumbnails.first == nil
---
SELECT "thumbnails".* FROM "thumbnails" WHERE "thumbnails"."video_id" = 196 LIMIT 1