app/controllers/home_controller.rb

  def index
		@all_categories = Category.all
		@banners = Banner.all
		@featured_videos = Video.featured.limit(3)
		@latest_videos = Video.for_page
		@events = Event.featured.limit(3)
		@albums = Album.featured.limit(3)
---
SELECT "categories".* FROM "categories"
SELECT "banners".* FROM "banners"
SELECT "videos".* FROM "videos" ORDER BY created_at DESC LIMIT 3
SELECT "events".* FROM "events" WHERE "events"."featured" = 't' LIMIT 3
SELECT "albums".* FROM "albums" WHERE "albums"."featured" = 't' LIMIT 3