app/controllers/information_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'undefined' LIMIT 1
---
  def show
		@user = User.find_by_username(params[:username])